df <- read.table("propotion.csv", header=TRUE)
df <- read.table("drunk_death.csv", header=TRUE)
df <- read.table("drunk_accident.csv", header=TRUE)

dat_v=c(21,105,24,32)
barplot(dat_v,names.arg = c("酒酔い","酒気帯び0.25mg以上","酒気帯び0.25mg未満","基準以下"),xlab="Type",ylab="number",main="平成27年度における飲酒運転の分類別死亡者数")

dat_v2=c(238,2189,565,697)
barplot(dat_v2,names.arg = c("酒酔い","酒気帯び0.25mg以上","酒気帯び0.25mg未満","基準以下"),xlab="Type",ylab="number",main="平成27年度における飲酒運転による分類別事故数")

dat_m=matrix(c(15504,149,3432,174,755,221,11849,120,13427,265,201,21,503,22,33845,423,42103,592,85601,460,59044,82,155446,395,3687,93,11494,448,951,73),2,15)
barplot(dat_m,names.arg = c("信号無視","通行区分","最高速度","優先通行妨害","歩行者妨害","酒酔い運転","過労運転","運転操作不適","漫然運転","脇見運転","動静不注意","安全不確認","安全速度","その他の違反","違反不明"),xlab="type",ylab="number",main="平成27年度における種類別事故数")

dat_v3=c(0.96,5.07,29.27,1.01,1.97,10.45,4.37,1.25,1.41,0.54,0.14,0.25,2.53,3.90,7.68)
barplot(dat_v3,names.arg = c("信号無視","通行区分","最高速度","優先通行妨害","歩行者妨害","酒酔い運転","過労運転","運転操作不適","漫然運転","脇見運転","動静不注意","安全不確認","安全速度","その他の違反","違反不明"),xlab="type",ylab="percentage",main="平成27年度における事故の種類別死亡率")

dat_m2=matrix(c(657,7235,2087,2631,565,6055,1743,2369,396,3959,1248,1432,336,3351,1019,1188,304,3191,943,1024,254,3185,892,1025,250,2786,826,927,240,2655,703,835,212,2528,636,787,270,2421,571,722,238,2189,565,697),4,11)
barplot(dat_m2,names.arg=c("2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015"),xlab="year",ylab="number",main="飲酒運転の種類別事故数の推移",legend.text = c("酒酔い","酒気帯び0.25mg以上","酒気帯び0.25mg未満","基準以下"))
